[
  "South Korea says it has no written pact on US trade deal",
  "Fraser Health argues B.C. Supreme Court doesn't have jurisdiction to hear whistleblower lawsuit",
  "Canada Post workers to finish vote on ‘final’ offers",
  "US imposes visa sanctions on Palestinian Authority officials, PLO members",
  "Israel evacuates diplomatic staff in the UAE, Israeli media say",
  "Gunman kills 5 people at Bangkok market before killing himself, police say",
  "Thailand, Cambodia agree to ceasefire after clashes displace more than 300,000 people",
  "Saskatoon approved permit for MAGA musician's upcoming concert, city solicitor confirms",
  "Exclusive: US plans to fund deportations from Costa Rica, document shows",
  "Syria forms committee to investigate Sweida violence",
  "'I was so close': Summer McIntosh wins 3rd gold medal, just misses world record in 200m butterfly",
  "Blue Jays acquire former Cy Young-winning pitcher Shane Bieber from Guardians",
  "Ash falls in Lytton, B.C., as crews battle nearby out-of-control wildfire",
  "NYC shooter purchased rifle from Las Vegas casino supervisor, police say",
  "In Winnipeg, U.S. ambassador to Canada issues warning not to overlook cross-border ties",
  "76 cats surrendered to Ontario SPCA in 4 days: ‘We couldn’t have planned for this’",
  "Gunman who killed 4 at NYC building was targeting NFL offices but took wrong elevator, mayor says",
  "The race to provide AI agents for tedious tasks is on, but should we trust them with our data?",
  "B.C. author leads 'David against Goliath' lawsuits alleging big tech used writers' works to train AI",
  "German police find more damage along railway disrupted by suspected sabotage",
  "European court ruling challenges Italy's migrant policy with Albania",
  "Elections Canada workers say issues in 2 Cape Breton offices made April vote a 'nightmare'",
  "Exclusive: Trump's call broke deadlock in Thailand-Cambodia border crisis",
  "Uncertainty abounds as Trump EPA plans rollback of key finding behind U.S. greenhouse gas rules",
  "Saskatoon police investigate suspicious death at Riversdale home",
  "Wildfires scorch large swaths of southeast Europe and the Balkans",
  "10 frightened limo passengers forced impaired driver to pull over on Hamilton highway, say police",
  "Quebec anti-abortion group fails to reverse decision banning protests in front of clinics",
  "O-Pipon-Na-Piwin Cree Nation in Manitoba stuck in 'waiting game' with no power for 3 weeks",
  "Search for B.C.'s Best Symbol: Provincial Semifinals",
  "Republican-led committee rejects Epstein associate's request for immunity as condition of testimony",
  "Sierra Leone chimp refuge shuts doors to tourists to protest deforestation",
  "Flooding leaves 14 dead, missing in Vietnam's Dien Bien",
  "By acknowledging 'real starvation' in Gaza, Trump sharpens Western pressure on Netanyahu",
  "False alarm prompts Israeli interceptor launch near Gaza Strip",
  "Turbulence injures 25 passengers on Delta flight, forces plane to land",
  "Cécile Dionne, one of the famous Dionne quintuplets, dead at 91",
  "Russian strikes kill 27 civilians in Ukraine despite Trump threats of sanctions",
  "Powerful Russian earthquake creates small tsunamis, with many areas still on high alert",
  "Video shows Mounties, looking for impaired driver, ask to speak to man killed last year",
  "US envoy Witkoff visits aid operation in Gaza rejected by UN as unsafe",
  "Migrant worker calls proposed spike in housing cost payroll deduction 'wickedness'",
  "India engaged in further trade talks with US, Indian government source says",
  "Trump officials to inspect Gaza food distribution as death toll rises",
  "Relief in Southeast Asia as Trump's tariffs level playing field",
  "Petition for referendum to ensure Alberta remains in Canada approved by Elections Alberta",
  "Canadian job vacancies fell to a near 8-year low amid hiring freezes",
  "Putin, facing Trump deadline, signals no change in Russia's stance on Ukraine",
  "Carney ‘disappointed’ in Trump’s 35% tariff on Canada",
  "Farmers consider abandoning drought-hit region in central Hungary",
  "Manitoba man who killed New Jersey woman in 1997 cold case sentenced to 10 years",
  "'Look in my eyes and tell me you're sorry,' victim's brother tells stepdad behind accidental fatal shooting",
  "N.S. woman says court system failing her as intimate partner violence case drags on",
  "400 properties ordered evacuated after wildfire closes highway in B.C.'s Okanagan region",
  "Two-year-old among 28 dead in Thursday's Russian attack on Kyiv",
  "Fugitive ex-Olympian's alleged cocaine courier agrees to U.S. extradition",
  "Nova Scotia Community College opens new 200-bed student residence in Dartmouth",
  "Supreme Court won’t hear case of Ontario man who fatally shot Indigenous man",
  "Beijing says 31 seniors died in flooded nursing home amid deadly storms",
  "B.C. lifts tsunami advisory after major earthquake off Russian coast",
  "Montreal drug case threatened after prosecutor admits to relationship with defence lawyer",
  "Canada PM says he is disappointed as Trump orders tariff hike",
  "Read Carney’s full response to Trump’s 35% tariff on Canada",
  "Glooscap First Nation in Nova Scotia to launch seafood market this year",
  "Trump escalates trade war with Canada following Palestine stance",
  "B.C. launches new police unit to crack down on human trafficking",
  "Crown attorneys' group accuses politicians, media of 'attacks' on justice system",
  "Ontario officially cancels $100M Starlink contract, won't say cost to taxpayers",
  "U.S. ends ‘de minimus’ tariff exemption for all low-value packages",
  "Calgary police arrest 3 youths after bus driver robbed at knifepoint",
  "Canada weighing recognition of Palestinian statehood: source",
  "Beauval, Sask., residents start returning home after month-long wildfire evacuation",
  "Quebec population expected to decrease over next five years",
  "Inuit Child First Initiative announcement imminent, says federal minister",
  "U.S. Senate confirms former Trump lawyer Emil Bove as federal judge, despite whistleblower concerns",
  "Trump administration refers Harvard to Justice Department in civil rights probe",
  "Ontario city facing full $18.3M cyberattack bill after insurer denies claim",
  "Police catch man charged with murder in Ontario hit-and-run",
  "In Tofino, B.C., two different reactions to the tsunami advisory news",
  "Hudson's Bay has repeatedly threatened to end lease deal with B.C. billionaire, court filings say",
  "Poilievre squares off in debate with 9 other candidates vying for seat in Alberta byelection",
  "Ukraine parliament restores anti-graft watchdogs’ independence amid uproar",
  "Charging a soldier with terrorism may be a first, but Canadian military has history of extremism in its ranks",
  "Slovenia imposes arms embargo on Israel",
  "Ukrainians mourn 31 killed in Russian strike on Kyiv",
  "Israel begins limited pause in fighting as criticism mounts over hunger in Gaza",
  "Heat warnings issued as Edmonton, northern Alberta to see 30 C temperatures",
  "Despite Trump's ceasefire call, Thailand and Cambodia continue shelling at border",
  "'Terrifying': Expectant parents face uncertainty amid B.C.-wide maternity staffing shortages",
  "Trump hits more countries with steep tariffs, markets tumble",
  "Alberta's old coal mines contaminating rivers and endangering fish, study finds",
  "Some business owners say arson, extortion threats are driving them out of Winnipeg",
  "Alberta byelection candidate back on campaign trail, citing no more 'credible threats'",
  "Cape Breton police investigate appearance of painted swastikas near Jewish cemetery",
  "Russian strikes kill at least 14 people in Kyiv, 6-year-old boy among dead",
  "Gaza mother worries time running out for evacuation of malnourished daughter",
  "Survivors recall frantic escape 20 years after Air France crash in Toronto",
  "Doug Ford wears it, Russ refuses it: Why gifts of beaded medallions are sparking debate",
  "Stocks sink on Bay and Wall Streets, but loonie rises following new tariffs",
  "Mother, newborn among at least 78 killed in Israeli strikes as some aid trickles in to Gaza",
  "Mobile homeowners say they feel 'trapped' as rising lot rents scare off buyers",
  "What Trump's tariff deals with Europe and Japan mean for Canada",
  "Summer McIntosh is staring down another world record — but will she go for it?",
  "White House says no decision yet for location of 2026 G20 summit",
  "Muskeg Fire forces Sask. northern village to evacuate",
  "Fans paying a premium to see first-place Blue Jays",
  "History at risk in Ontario’s Halton region as heritage service shutters: historians",
  "City of Vancouver backtracks on relocation of  'iconic' Trans Am Rapture art piece",
  "Trump says it is 'disgusting' what Russia doing to Ukraine",
  "U.S. extends trade deal with Mexico, sets tariffs for South Korea, Brazil as Trump's deadline nears",
  "Germany to deliver two Patriot systems to Ukraine in deal with US",
  "Portage man faces weapons, mischief charges after failed robbery: RCMP",
  "US Senator Wicker, head of Senate armed services panel, to visit Taiwan",
  "Burn ban in effect for Nova Scotia amid soaring temps, dry conditions",
  "US Senate committee backs more Ukraine funding, following Trump shift on aid",
  "Love-struck trucks and diggers: Estonia's take on 'Romeo and Juliet'",
  "Cambodia to nominate Donald Trump for Nobel Peace Prize, says deputy PM",
  "Banksy artwork removed from Venetian palazzo so it can be restored",
  "Bosnian Serb leader Dodik vows to defy political ban, write to Trump",
  "Winnipeg tattoo artist incorporates cremated ashes into custom body art",
  "Quebec car theft victims get green light for lawsuit over key fob security",
  "Chilean police return $125K in luxury watches stolen from Keanu Reeves",
  "'I won't back down': How and why Canadians are boycotting the U.S.",
  "Virginia councillor set on fire after attacker douses him in gasoline",
  "Staff for King Charles and Prince Harry met. Is a royal reconciliation in the air?",
  "A date? Just dinner? Doesn't matter. Justin Trudeau, Katy Perry buzz is good for their embattled brands",
  "Smaller alcohol producers, retailers urge Doug Ford to say no to store-brand booze sales",
  "Exclusive: Trump officials told Congress Israel agreed to match $30 million for GHF, sources say",
  "Sask. author's anti-racism book is among 596 banned by U.S. Department of Defence for use in its schools",
  "Sask. author's anti-racism book is among 596 banned by U.S. Department of Defense for use in its schools",
  "Can the UK child-proof the internet?",
  "Wildfire near Lytton, B.C., 3 times larger than initial estimate after aerial mapping",
  "UK ninja sword ban begins as 1,000 weapons surrendered in knife crime crackdown",
  "US ends ‘de minimus’ tariff exemption for all low-value packages",
  "Countries with no trade deal will hear from US by midnight, White House says",
  "Indonesian President Prabowo pardons political opponents",
  "Europe is breaking its reliance on American science",
  "Chongqing residents seek shelter as heatwave hits China's southwest",
  "1 dead, 2 injured after small plane crashes near Ottawa airport",
  "Trump to Canada: Recognizing Palestinian state makes trade deal ‘very hard’",
  "'From wedding bands to urns': Samaritan's Purse Canada helps Denare Beach residents recover possessions",
  "Thailand returns some Cambodian soldiers ahead of key border talks",
  "Teen girl found guilty of manslaughter in fatal swarming apologizes in court",
  "Japan, Hawaii and Russia downgrade tsunami warnings after powerful earthquake",
  "Torrential rain, flooding hit parts of northern China",
  "Trump is threatening Putin with a tighter ceasefire deadline. Russia is shrugging",
  "Zelenskiy, moving to defuse crisis, restores power of anti-graft agencies",
  "Trump's envoy meets Netanyahu for Gaza aid, ceasefire push",
  "‘Opportunistic theft’: Hamilton police charge woman in theft from Good Samaritan",
  "Capital Power still waiting for Alberta data centre powering opportunity",
  "South Korea's ex-leader Yoon lay on floor of cell and refused to be questioned, prosecutors say",
  "How an anti-porn lobby on payment processors censored thousands of video games",
  "Trump extends Mexico trade talks another 90 days, keeps tariffs in place",
  "Canadians' health data at risk of being handed over to U.S. authorities, experts warn",
  "Exclusive: US sanctions force vessels with Russian oil to divert from India, sources say",
  "Toronto’s new renovictions bylaw comes into effect, aimed at protecting tenants",
  "Peace activists lament unravelling of landmine pact named after Ottawa",
  "Bank of Canada holds interest rate at 2.75% as economy shows resilience in the face of tariffs",
  "German armed forces see 28% surge in recruits in NATO defence boost",
  "How some northern Ontario cities have solved their lifeguard shortages",
  "Canada Goose's summer apparel helps shift company from winter-brand perception",
  "France starts airdrops of humanitarian aid into Gaza",
  "Hungary government to draw up plans to protect jobs after US-EU trade deal",
  "Hong Kong has issued a warrant for his arrest, but this Vancouverite isn't worried",
  "Trump gives Mexico 90-day tariff reprieve as deadline for higher duties looms",
  "U.S. sanctions Palestinian Authority, claims peace efforts undermined",
  "Ontario paramedic fired for criticizing Israel on social media hopes to be reinstated",
  "'I was so close': McIntosh wins 3rd gold medal, just misses world 200m butterfly record",
  "Canada, allies warn Iran working to ‘kill, kidnap and harass’ people abroad",
  "Cecile Dionne, one of the famous quintuplets, dead at 91",
  "Roads into Simon Fraser University's Burnaby campus reopen after closure for police incident, university says",
  "Petition to keep Alberta in Canada can start rolling out, says electoral officer",
  "Police recover body of man who drowned trying to rescue woman in Ottawa River",
  "Ontario judge reprimanded, must apologize to Peter Khill after giving wrong prison term for manslaughter",
  "US appeals court scrutinizes Trump's use of tariffs as trade deadline looms",
  "What happens on Aug. 1 if Canada can’t get a trade deal with Trump?",
  "Trump gives Mexico trade talk reprieve as other countries push for deals",
  "German foreign minister tones down Palestinian recognition talk on West Bank trip",
  "Trump slams Canada's plan to recognize Palestinian state amid trade talks",
  "'Stay elevated': Tsunami warnings triggered flood of evacuations across Pacific region",
  "Israeli minister hints at annexing parts of Gaza as hunger-related deaths mount",
  "Russian missile, drone attacks on Kyiv kill at least 13 people and wound more than 130",
  "Many Canadians who voted in 2025 didn’t feel fully informed: poll",
  "Cluster of new Ontario measles cases mostly in the Sudbury area",
  "Blue Jays acquire former Cy Young-winning pitcher Shane Bieber from Cleveland",
  "This is the court case that could kneecap most Trump tariffs",
  "CF Snowbirds to put on a show over Edmonton on Wednesday",
  "Latest count finds record number of people experiencing homelessness in Metro Vancouver",
  "Evacuation orders issued for Lytton First Nation reserves in B.C. as wildfire grows nearby",
  "Trump’s universal 50% copper tariffs take effect Aug. 1. What’s impacted?",
  "Colombia deforestation surges 43% fueled by fires, land-grabbing"
]